# Taps
tap "homebrew/cask-fonts"              # fonts
tap "buo/cask-upgrade"                 # upgrade cask-installed apps with `brew cu`

# Options
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', require_sha: true


###############################################################################
# Fonts
###############################################################################
cask 'font-roboto-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-hack-nerd-font'


###############################################################################
# Applications
###############################################################################
cask '1password'                                   # Password manager
cask '1password-cli'                               # Access 1Password from the cmdline
#cask 'alt-tab'                                     # Windows-style app switching
cask 'arc'                                         # Browser
#cask 'authy'                                       # MFA
cask 'bartender'                                   # Manage and hide menubar items
#cask 'bettermouse'                                 # Fine-grained mouse control
#cask 'amazon-photos', args: { require_sha: false } # Family file storage
cask 'cleanshot'                                   # Screenshot utility
mas  'Dato', id: 1470584107                        # Calendar updates and world clock
#cask 'descript'                                    # Video content creation
#cask 'deskpad'                                     # Virtual desktop for presenting
#cask 'diffusionbee'                                # AI image generation
#cask 'elgato-stream-deck'                          # You always need more buttons
#cask 'gpg-suite'                                   # GPG Keys management
cask 'google-drive', args: { require_sha: false }  # Work file storage
cask 'microsoft-onenote'                           # Note-taking
cask 'notion'                                      # Notion
#cask 'obs'                                         # Video streaming tool
#cask 'raycast'                                     # Spotlight alternative
#cask 'todoist'                                     # Todo lists
#mas  'TP-Link Tapo', id: 1472718009                # Tapo smartplug integration (fails)
mas  'SponsorBlock for YouTube', id: 1573461917    # Skip sponsors in videos
cask 'spotify', args: { require_sha: false }       # Music
brew 'starship'                                    # Command prompt customisation
#cask 'topnotch'                                    # Hide the top-notch on macbook
cask 'warp'                                        # Terminal
cask 'whatsapp'                                    # Messaging
mas  'Unsplash Wallpapers', id: 1284863847         # Randomised wallpapers
cask 'yubico-yubikey-manager'                      # Yubikey device management


###############################################################################
# Mac OS Quick-Look Plugins
###############################################################################
#cask 'qlcolorcode'    # QL for code with highlighting
#cask 'qlmarkdown'     # QL for markdown files
#cask 'qlvideo'        # QL for video formats


###############################################################################
# Development
###############################################################################
brew   'git'                  # Version control
brew   'httpie'               # HTTP / API client (better curl)
brew   'python'               # Python interpreter
#cask   'rancher'              # Rancher Desktop (docker and kubernetes)

#cask   'visual-studio-code'              # IDE
#vscode 'tinkertrain.theme-panda'         # IDE: make it pretty
#vscode 'ms-vscode-remote.vscode-remote-extensionpack'  # IDE: dev in containers
#vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'   # IDE: dev in kuberntes
#vscode 'yzhang.markdown-all-in-one'      # IDE: better markdown support
#vscode 'donjayamanne.githistory'         # IDE: view git log, history, etc
#vscode 'formulahendry.code-runner'       # IDE: run specific code snippets
#vscode 'chrmarti.regex'                  # IDE: visual preview of regexp
#vscode 'wayou.vscode-todo-highlight'     # IDE: highlight TODO items
#vscode 'kamikillerto.vscode-colorize'    # IDE: visualise CSS colours
#vscode 'ms-azuretools.vscode-docker'     # IDE: docker integration
#vscode 'GitLab.gitlab-workflow'          # IDE: GitLab integration
#vscode 'TabNine.tabnine-vscode'          # IDE: AI Autocomplete
#vscode 'EliverLara.andromeda'            # IDE: Theme
#vscode 'rangav.vscode-thunder-client'    # IDE: Rest API Client


###############################################################################
# Command Line Tools
###############################################################################

# CLI Essentials
brew 'bash'                   # Shell
brew 'chezmoi'                # Manage dotfiles
brew 'nano'                   # Text editor

# CLI Basics
#brew 'bat'                    # Output highlighting (a better cat)
#brew 'bat-extras'             # Colourful wrappers for other utilities
#brew 'eza'                    # Listing files (a better ls)
brew 'jq'                     # JSON parser
#brew 'ripgrep'                # Line-orientated search tool (a better grep)
brew 'tldr'                   # Brief documentation (a better man)
#brew 'dog'                    # DNS lookups (a better dig)
brew 'terminal-notifier'      # Send Mac OS notifications from the terminal
#brew 'zoxide'                 # Smarter directory navigation (a better cd)

# CLI Monitoring / Performance
brew 'bpytop'                 # Resource monitoring (better htop)
brew 'nmap'                   # Network scanning

# CLI Fun
brew 'lolcat'
brew 'neofetch'


###############################################################################
# Whalebrew
###############################################################################

#brew 'whalebrew'
#whalebrew 'whalebrew/ffmpeg'
#test
